package com.eq.eq_world;

import android.os.Bundle;
import android.text.Editable;
import android.text.TextWatcher;
import android.view.View;
import android.view.Window;
import android.view.WindowManager;
import android.widget.Button;
import android.widget.EditText;

import androidx.appcompat.app.AppCompatActivity;
import androidx.constraintlayout.widget.ConstraintLayout;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.eq.eq_world.Adapter.ListActAdapter;
import com.eq.eq_world.Model.ListActItem;

import java.util.ArrayList;
import java.util.List;

public class ListActActivity extends AppCompatActivity {
    RecyclerView lARecyclerview;
    ListActAdapter lAAdapter;
    List<ListActItem> lAData;
    ConstraintLayout lALayout;
    EditText lASearchInput;
    CharSequence lAsearch = "";
    Button btBack;

    @Override
    protected void onCreate(Bundle savedInstanceState) {


        requestWindowFeature(Window.FEATURE_NO_TITLE);
        getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN,
                WindowManager.LayoutParams.FLAG_FULLSCREEN);
        super.onCreate(savedInstanceState);
        // let's make this activity on full screen
        setContentView(R.layout.activity_list_act);

        // ini view

        lALayout = findViewById(R.id.act_layout);
        lASearchInput = findViewById(R.id.search_input_act);
        lARecyclerview = findViewById(R.id.act_rv);
        lAData = new ArrayList<>();


        // load theme state


        // fill list with data
        // just for testing purpose i will fill the list with random data
        // you may get your data from an api / firebase or sqlite database ...
        lAData.add(new ListActItem("ชิปปี้ชิป","ระยะเวลา : 5-10 นาที","ประเภท : ใครแพ้ต้องถูกทำโทษ","จำนวนผู้เล่น : 4-8 คน" ,"ให้ทุกคนยืนเรียงแถวเป็นหน้ากระดาน โดยจะมีเพลงที่ร้องว่า “ชิบปี้ชิบปี้ชิบปี้ชิบ” ร้องแบบนี้นับเป็น1รอบ และจะร้องวนไปเรื่อยๆหลายๆรอบ ในรอบแรกให้คนที่อยู่หัวแถวเริ่มทำท่าอะไรก็ได้ พอเพลงขึ้นรอบที่2 ให้คนที่2copyท่าของคนแรกในรอบแรก ส่วนคนแรกให้เปลี่ยนท่า พอเพลงขึ้นรอบที่3 คนที่3ก็จะcopyท่าคนที่2 คนที่2ก็copyท่าคนแรก เป็นแบบนี้ไปเรื่อยๆ จนกว่าจะพอใจ\n" +
                "ตัวอย่าง\n" +
                "▪รอบแรก\n" +
                "A โบกมือ\n" +
                "B นิ่ง\n" +
                "C นิ่ง\n" +
                "D นิ่ง\n" +
                "▪รอบ2\n" +
                "A แทงปลาไหล\n" +
                "B โบกมือ\n" +
                "C นิ่ง\n" +
                "D นิ่ง\n" +
                "▪รอบ3\n" +
                "A นกบิน\n" +
                "B แทงปลาไหล\n" +
                "C โบกมือ\n" +
                "D นิ่ง\n" +
                "▪รอบ4\n" +
                "A ส่ายเอว\n" +
                "B นกบิน \n" +
                "C แทงปลาไหล\n" +
                "D โบกมือ \n" +
                ".\n" +
                "เพลงประกอบ\n" +
                "*ชิบปี้ชิบปี้ชิบปี้ชิบ ชิบปี้ชิบปี้ชิบปี้ชิบ\n" +
                "ชิบปี้ชิบปี้ชิบปี้ชิบ ชิบปี้ชิบปี้ชิบปี้ชิบ*\n","tsN-MkpiZB0"));
        lAData.add(new ListActItem("Emotion-Level ","ระยะเวลา : 5 นาที","ประเภท : ใครแพ้ต้องถูกทำโทษ","จำนวนผู้เล่น : 3-6 คน" ,"ให้ทุกคนยืนเรียงแถวหน้ากระดาน ให้หัวแถวมาจับฉลาก “Emotion” ที่เราเตรียมไว้ ซึ่งในฉลากจะเป็นท่าทางต่างๆ เช่น เสียใจ โกรธ หัวเราะ ปวดขี้ เป็นต้น โดยให้คนที่อยู่หัวแถวทำEmotionนั้นๆ แต่จะเพิ่มระดับLevelของการแสดงท่าทางขึ้นเรื่อยๆจากหัวแถวไปท้ายแถว\n" +
                "ตัวอย่างเช่น คนหัวแถวเสียใจLevel1 คนท้ายแถวเสียใจLevel6 เป็นต้น","2S24-y0Ij3Y"));
        lAData.add(new ListActItem("ปะแป้ง","ระยะเวลา : 5 นาที","ประเภท : ใครแพ้ต้องถูกทำโทษ","จำนวนผู้เล่น : ไม่จำกัด" ,"บทลงโทษสุดคลาสสิค เทแป้งใส่มือแล้วไปปะเพื่อนได้เลย!!! หรืออาจจะสับขาหลอกให้ปะหน้าตัวเองก็ตามแต่ชอบเลยงับ","IHNzOHi8sJs"));
        lAData.add(new ListActItem("Verb/Adverb","ระยะเวลา : 5 นาที","ประเภท : ใครแพ้ต้องถูกทำโทษ","จำนวนผู้เล่น : ไม่จำกัด" ,"คนที่โดนลงโทษต้องจับฉลาก2กล่อง กล่อง “VERB” และกล่อง “ADVERB” โดยกล่องแรกจะบรรจุกริยาต่างๆ เช่น กระโดดตบ เต้นไก่ย่าง วิ่งรอบห้อง เป็นต้น ส่วนกล่องที่สองจะบรรจุคำวิเศษต่างๆ เช่น อย่างโศกเศร้า อย่างบ้าคลั่ง อย่าเร่าร้อน เป็นต้น เมื่อจับครบ2กล่อง จะเอาคำมาบวกกันเป็น เต้นไก่ย่างอย่างเร่าร้อน แบบนี้","Nu2yQ1zYDYU"));
        lAData.add(new ListActItem("The Wrapper","ระยะเวลา : 5 นาที","ประเภท : ใครแพ้ต้องถูกทำโทษ","จำนวนผู้เล่น : ไม่จำกัด" ,"โจ้วๆ ง่ายๆก็คือ Wrapperพลาสติกใสๆนั่นเอง วิธีการทำโทษคือ ขึงWrapperไว้2ด้านให้ตึงๆ (อาจจะขึงกับเสา หรือใช้คนถือก็ได้) แล้วให้ผู้เล่นนำหน้าไปแนบแล้วดึงWrapperให้ขาด!","vecSVX1QYbQ"));
        lAData.add(new ListActItem("ทะเลาะกับเสา","ระยะเวลา : 5 นาที","ประเภท : ใครแพ้ต้องถูกทำโทษ","จำนวนผู้เล่น : ไม่จำกัด" ,"คนปกติที่ไหนจะทะเลาะกับเสา55555 วิธีการลงโทษ คือ ให้เดินไปที่เสา แล้วทะเลาะกับมันซะ จะว่ามัน ด่ามัน แค่ไหนก็ได้ จนกว่าเพื่อนๆจะพอใจ55555\n" +
                "“เจ้าเสาอ้วน อ้วนขนาดนี้อย่ามาเป็นเสาตึกเลย ไปเป็นเสาทางด่วนดีกว่า”","vrdk3IGcau8"));
        lAData.add(new ListActItem("โน๊ตดนตรี ","ระยะเวลา : 5-10 นาที","ประเภท : ใครแพ้ต้องถูกทำโทษ","จำนวนผู้เล่น : 7+ คน" ,"ให้แต่ละคนยืนเรียงแถวหน้ากระดาน หลังจากนั้นให้หันหลังและนั่งยองๆ แต่ละคนจะทำหน้าที่เป็นโน๊ตดนตรีแต่ละตัว(โด เร มี ฟา ซอล ลา ที )โดยมีMCเป็นConductor 55555 ถ้าMCสั่ง “โด~” คนที่เป็นโน๊ตตัวโด จะต้องยกตูดขึ้นมา1ที อ้าา เริ่มนึกความสนุกออกแล้วใช่ไหม555 ถ้าพร้อมแล้วMC ก็สามารถบรรเลงเพลงได้เลย เช่น\n" +
                "“มี เร โด เร มี มี มี เร เร เร มี ซอล ซอล”","ILU9NbWn4t0"));
        lAData.add(new ListActItem("เหยียบหนังสือพิมพ์","ระยะเวลา : 10-15 นาที","ประเภท : Ice-Breaking","จำนวนผู้เล่น : 10-20 คน","แบ่งออกเป็นทีม ทีมละ5-10คน กอดคอกันเป็นก้อนๆ แต่ละทีมจะต้องยืนอยู่บนหนังสือพิมพ์แผ่นเล็กๆเท่านั้น โดยห้ามมีอวัยวะส่วนใดแตะพื้นด้านนอกเป็นอันขาด โดยจะเล่นหลายรอบ แต่ละรอบหนังสือพิมพ์ก็จะมีขนาดเล็กลงเรื่อยๆจ้า(Staffเดินไปพับให้เล็กลง) คนในทีมก็ต้องช่วยกันพยุงตัวให้อยู่ในหนังสือพิมพ์ให้ได้\n" +
                ".\n" +
                "การตัดสิน : ลดขนาดหนังสือพิมพ์ไปเรื่อยๆ ทีมไหนอยู่รอดเป็นทีมสุดท้ายเป็นฝ่ายชนะ!\n" +
                ".\n" +
                "Climax : บางทีหนังสือพิมพ์อันเล็กเท่าตับแมวละ แต่ก็ยังมีทีมที่รอดอยู่อีก","BVwAVbKYYeM"));
        lAData.add(new ListActItem("เป็ดข้ามน้ำ","ระยะเวลา : 10-15 นาที","ประเภท : Ice-Breaking","จำนวนผู้เล่น : 10-20 คน","แบ่งออกเป็นหลายกลุ่มแข่งกัน แต่ละกลุ่มจะเริ่มStartที่จุดเริ่มต้นฝั่งเดียวกัน และจะต้องนำพาสมาชิกทั้งทีมไปที่เส้นชัยฝั่งตรงข้ามให้ได้เร็วที่สุด โดยห้ามมีอวัยวะส่วนใดส่วนหนึ่งแตะพื้นเป็นอันขาด แต่ละทีมจะได้รับอุปกรณ์เพียงแค่ “หนังสือพิมพ์2แผ่น” เท่านั้น ทำยังไงก็ได้ให้ไปถึงอีกฝั่ง\n" +
                ".\n" +
                "การตัดสิน : ทีมไหนที่สามารถไปถึงเส้นชัยได้หมดทั้งทีมก่อน โดยไม่สัมผัสพื้น จะเป็นฝ่ายชนะ!\n" +
                ".\n" +
                "ปล.เกมนี้สามารถชนะได้หลายวิธีมากๆ บางวิธีก็เร็วมากๆแต่อาจต้องลองคิดนอกกรอบดูบ้างนะ ลองไปคิดเล่นๆกันดู","m8MfJg68oCs"));
        lAData.add(new ListActItem("ขี้เปลี่ยนส้วม","ระยะเวลา : 10-15 นาที","ประเภท : Ice-Breaking","จำนวนผู้เล่น : 25-50 คน","หรือเรียกอีกชื่อนึงว่า “หอยเปลี่ยนฝา” กติกาคือ ให้จับกลุ่มกันกลุ่มละ3คน คนนึงเป็นขี้ อีก2คนเป็นส้วม โดยที่ส้วมทั้งสองคนจะต้องจับมือกันทั้งสองข้างโอบล้อมขี้ไว้ตรงกลาง โดยMCจะบอกคำสั่งต่างๆดังนี้\n" +
                "“ขี้เปลี่ยนส้วม” ให้ขี้วิ่งไปหาส้วมใหม่ โดยที่ส้วมทั้งสองยืนอยู่ที่เดิม\n" +
                "“ส้วมเปลี่ยนขี้” ให้ส้วมทั้งสองวิ่งไปหาขี้ตัวใหม่ โดยที่ขี้ยืนอยู่ที่เดิม\n" +
                "“ส้วมระเบิด” ให้ทุกกลุ่มแตกออกจากกัน แล้วจับกลุ่มใหม่\n" +
                ".\n" +
                "การตัดสิน : เล่นไปเรื่อยๆ จับคนช้าออกมาทำโทษ!\n" +
                ".\n" +
                "ปล.อาจจะเพิ่มจำนวนส้วม หรือจำนวนขี้ก็ได้ เช่น ส้วม3 ขี้2 เป็นต้น\n" +
                ".\n" +
                "ปล2.คำสั่งอาจใช้เป็น “หอยเปลี่ยนฝา”, “ฝาเปลี่ยนหอย” และ “หอยระเบิด” แทนก็ได้\n" +
                ".\n" +
                "เพลงประกอบ “หอยจี้ลี่”\n" +
                "*หอยจี้ลี่ หอยจี้ลี่มีฝาเดียว \n" +
                "สองฝาก็ยิ่งเสียว สองฝาก็ยิ่งเสียว \n" +
                "หอยฝาเดียว หอยจี้ลี่ หอยฝาเดียว หอยจี้ลี่\n","6eEZ7DJMzuk"));
        lAData.add(new ListActItem("ฉุบต่อแถว","ระยะเวลา : 10 นาที","ประเภท : Ice-Breaking","จำนวนผู้เล่น : 30-60 คน","ให้ทุกคนจับคู่เป่ายิ้งฉุบกับเพื่อน ใครแพ้ต้องไปต่อหลังคนชนะ ต่อมา คนที่เป็นหัวแถวจะต้องเป่ายิ้งฉุบกันต่อในรอบที่2 แถวที่แพ้ก็จะต้องไปต่อหลังแถวที่ชนะ เล่นไปเรื่อยๆหลายๆรอบ จนกว่าจะได้แถวที่ชนะเพียงแถวเดียว\n" +
                ".\n" +
                "การตัดสิน : แถวสุดท้ายที่แพ้จะโดนทำโทษ!!!\n" +
                ".\n" +
                "ปล.อาจจะเล่นแบบปล่อยโฟลวไม่ต้องเล่นเป็นรอบๆก็ได้","mr5bu2cxdzU&t=37s"));
        lAData.add(new ListActItem("เจ้าดอกลั่นทม","ระยะเวลา : 45 นาที","ประเภท : Ice-Breaking","จำนวนผู้เล่น : ไม่จำกัด","จะเรียกว่าเพลงประกอบท่าทางเพื่อวอร์มอัพสมองให้มีสติก่อนทำกิจกรรมก็ว่าได้ เริ่มจากให้ทุกคนตั้งมือข้างซ้ายไว้เป็นดอกลั่นทมตูมๆ และใช้มือขวาทำท่าทางประกอบการร้องเพลงดังภาพ ร้องเล่นกันไปสักแปปเบื่อเมื่อไรก็เปลี่ยนเกม\n" +
                ".\n" +
                "ปล. ร้องวนไปจ้า รอบหลังๆก็เพิ่มความเร็วให้คนทำตามไม่ทัน สุดท้ายก็จับคนทำช้า ทำผิดออกมาทำโทษ 5555\n" +
                ".\n" +
                "เนื้อเพลง\n" +
                "*โอ้เจ้าดอกลั่นทม ฉันเคยเด็ดดม ฉันเคยเด็ดเล่น\n" +
                "เด็ดเช้า เด็ดเย็น ฉันเคยเด็ดเล่น เด็ดดม เด็ดดม\n","WZwr2a_lFWY" ));
        lAData.add(new ListActItem("ยิ้งฉุบอีโวลูชั่น","ระยะเวลา : 10-15 นาที","ประเภท : Ice-Breaking","จำนวนผู้เล่น : 30-60 คน","เริ่มต้นเกมทุกคนจะอยู่ในห่วงโซ่อาหารที่มีสิ่งมีชีวิตนานาชนิดตั้งแต่ชั้นต่ำจนชั้นสูง ไล่จาก สเปิร์ม กบ กระต่าย ลิง และมนุษย์ตามลำดับ สิ่งมีชีวิตแต่ละชนิดก็จะมีท่าประจำตัวของมัน ซึ่งในตอนแรกทุกคนเกิดมาเป็นสเปิร์ม ทำท่าสเปิร์มแหวกว่ายไปมา สเปิร์มแต่ละตัวจะอีโวลูชั่นเป็นกบได้โดยการเป่ายิ้งฉุบกันให้ชนะ โดยมีกติกาก็คือ จะต้องเป่ายิ้งฉุบกับสิ่งมีชีวิตประเภทเดียวกันเท่านั้น เช่น สเปิร์มกับสเปิร์ม กบกับกบ กระต่ายกับกระต่าย เป็นต้น คนที่ฉุบชนะจะได้อีโวลูชั่น ส่วนคนแพ้จะเป็นตัวเดิมต่อไป \n" +
                ".\n" +
                "การตัดสิน : เล่นไปเรื่อยๆ ใครฉุบชนะจนกลายเป็นมนุษย์ถือว่ารอด ส่วนสิ่งมีชีวิตที่เหลือ(จะเหลือชนิดละตัวเท่านั้น) ต้องโดนลงโทษ!!! \n" +
                ".\n" +
                "Climax : การได้เห็นเพื่อนที่เพิ่งรู้จักกัน ทำท่าตลกๆ ก็เป็นการicebreakที่ดีมากๆ","zndvqTc4P9I"));
        lAData.add(new ListActItem("เจ้านกน้อย","ระยะเวลา : 5-10 นาที","ประเภท : Ice-Breaking","จำนวนผู้เล่น : 20-50 คน","ให้ทุกคนเกาะไหล่คนข้างหน้า MCจะมีมือวิเศษ เมื่อโบกมือไปทางไหน ทุกคนจะต้องโยกตัวไปตามทิศทางนั้น เช่น โบกไปทางซ้าย ทุกคนก็จะเอนตัวไปทางซ้าย เป็นต้น โดยจะมีเพลงประกอบ คือเพลง “เจ้านกน้อย” \n" +
                ".\n" +
                "ปล.มือวิเศษนี้สามารถโยนส่งต่อไปให้เพื่อนๆเป็นคนนำโยกได้\n" +
                ".\n" +
                "เพลงประกอบ “เจ้านกน้อย”\n" +
                "*เจ้านกน้อยคล้อยบินสู่เวหา\n" +
                "เจ้าถลาเล่นลมชมฤดี\n" +
                "บินบิน ถลาถลา เล่นลม บินล่อง บินลอย\n" +
                "บินบิน ถลาถลา เล่นลม บินล่อง บินลอย\n","kOHB85vDuow" ));
        lAData.add(new ListActItem("รหัสปรบมือ","ระยะเวลา : 10-15 นาที(ใส่มั่วทุกอันนะ)","ประเภท : เกมเตรียมความพร้อม","จำนวนผู้เเล่น","> ผู้นำกิจกรรมพูดว่า “ทำอะไรดีจ๊ะ?” ให้ผู้เข้าร่วมที่เป็นผู้ชายถามกลับว่า “ทำอะไรดีครับ ?” ส่วนผู้หญิงถามกลับว่า “ทำอะไรดีค่ะ ?” พร้อมกับปรบมือเป็นจังหวะ\n" +
                "      > จากนั้นผู้นำกิจกรรมบอกให้ทำอะไร ผู้เข้าร่วมต้องทำตามด้วยความรวดเร็ว เช่น ให้เอามือไปแตะฝาผนังห้อง เอามือไปจับสิ่งของภายในห้องที่เป็นสีเขียว หรือจับกลุ่ม 5 คน เป็นต้น\n" +
                "      > หากคนไหนทำช้า จะถูกเชิญออกมาด้านหน้าเพื่อสัมภาษณ์ หรือเต้นประกอบเพลงสนุกๆ หลังจากหยุดเล่นเกมแล้ว\n" +
                "      > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ จนกว่าผู้นำกิจกรรมเห็นสมควร จึงยุติการเล่น\n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "       เล่นได้ทุกช่วง เพื่อกระตุ้นผู้เข้าร่วมให้มีการเคลื่อนไหว ยังสามารถใช้ในการแบ่งกลุ่ม หรือจัดแถว ซึ่งจะทำให้เกิดความรวดเร็ว และสนุกสนานควบคู่กันไปด้วย ","Oao3j2hUVvE"));
        lAData.add(new ListActItem("ปรบมือชุดใหญ่","ระยะเวลา : 30 นาที","ประเภท : เกมเตรียมความพร้อม","จำนวนผู้เเล่น : ","> ให้ผู้เข้าร่วมรวมกลุ่มๆ ละ 3-5 คน แล้วนั่งลงเป็นวงกลมโดยให้หัวเข่าชนกัน (อาจจะเล่นต่อจากเกมทำอะไรดีจ๊ะ ? โดยบอกให้ผู้เข้าร่วมจับกลุ่ม ซึ่งจะทำให้เกิดความรวดเร็ว)\n" +
                "       > จากนั้นให้แต่ละกลุ่มหาจุดศูนย์กลางของวง แล้วให้ผู้เข้าร่วมเอามือซ้ายไขว้ไปด้านหลัง และมือขวาจับติ่งหูซ้าย\n" +
                "       > ผู้นำกิจกรรมเล่านิทานให้ฟังเรื่องหนึ่ง และขณะเล่านิทาน ถ้าผู้นำกิจกรรมพูดคำว่า “วัยรุ่น” ให้ผู้เข้าร่วมเอามือที่จับติ่งหูซ้ายตะปบลงไปตรงจุดศูนย์กลางของวง ถ้ามือคนใดอยู่บนสุด แสดงว่าทำช้า ผู้นำกิจกรรมอาจจะเชิญให้ออกมาเต้นประกอบเพลง\n" +
                "       > โดยคำที่จะใช้พูดควรเกี่ยวข้องกับโครงการ หรือการอบรมนั้นๆ และไม่ควรเกิน 2-3 พยางค์ ซึ่งต้องบอกให้กับผู้เข้าร่วมรับทราบ ก่อนที่จะเริ่มเล่านิทาน\n" +
                "       > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ สัก 2-3 รอบ โดยเปลี่ยนคำด้วย\n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "       จะขึ้นอยู่กับผู้นำกิจกรรมเป็นสำคัญ หากผู้นำเล่านิทานได้อรรถรส มีลูกเล่น ชั้นเชิง น้ำเสียงน่าตื่นเต้น รู้จังหวะหลอกล่อด้วยคำที่ขึ้นต้นเหมือนกัน เช่น วัยรุ่น ก็อาจจะพูดคำว่า วัยเยาว์ เป็นต้น นอกจากนี้นิทานที่เล่า ถ้าเป็นเรื่องราวที่นำเข้าสู่การอบรมได้ ก็จะเป็นการเพิ่มคุณค่าของเกมนี้ได้อีกด้วย","Pkh8UtuejGw"));
        lAData.add(new ListActItem("บอลวิเศษ","ระยะเวลา : 45 นาที","ประเภท : เกมเตรียมความพร้อม","จำนวนผู้เเล่น : ","> ให้รวมกันเป็นวงกลมใหญ่ 1 วง โดยผู้นำกิจกรรมยืนอยู่ตรงกลาง พร้อมกับถือบอลไว้ 1 ลูก\n" +
                "\n" +
                "        > ผู้นำกิจกรรมตั้งคำถาม โดยเริ่มจากคำถามง่ายๆ ที่ทุกคนสามารถตอบได้ เช่น ชื่ออะไร มาจากโรงเรียน/ชุมชนอะไร ชอบสัตว์เลี้ยงชนิดใด ชอบทานอาหารชนิดใด อยากไปเที่ยวที่ไหน เป็นต้น\n" +
                "\n" +
                "        > ผู้นำกิจกรรมถามผู้เข้าร่วม พร้อมกับโยนลูกบอลให้คนใดคนหนึ่ง เมื่อรับลูกบอลแล้วให้ตอบคำถาม ตอบเสร็จจึงโยนลูกบอลคืนให้กับผู้นำกิจกรรม จากนั้นผู้นำกิจกรรมโยนให้คนอื่นต่อไปเรื่อยๆ โดยใช้คำถามเดิมประมาณ 5-6 คน หรือ ตามความเหมาะสมเล่นในลักษณะเช่นเดียวกัน แต่เปลี่ยนคำถามไปเรื่อยๆ ซึ่งผู้นำกิจกรรมควรโยนลูกบอลให้กับผู้เข้าร่วมอย่างทั่วถึง จนกว่าผู้นำกิจกรรมเห็นสมควร จึงยุติการเล่น\n" +
                "\n" +
                " \n" +
                "\n" +
                "         จุดเด่นของเกม \n" +
                "\n" +
                "         ทุกคนมีโอกาสได้พูด แม้แต่ผู้เข้าร่วมที่มีความเขินอายก็จะได้มีส่วนร่วม ที่สำคัญสามารถเชื่อมโยงสู่เนื้อหาของการอบรมได้ คือ เมื่อผู้เข้าร่วมเริ่มคุ้นเคยจากการตอบคำถามง่ายๆ แล้วอาจปิดท้ายด้วยคำถามที่เกี่ยวข้องกับการอบรม เช่น เมื่อพูดถึงคำว่าโรคเอดส์นึกถึงอะไร ให้บอกชนิดของยาเสพติด เราจะช่วยลดภาวะโลกร้อนได้อย่างไรบ้าง เป็นต้น","=PKonqhZ5PsA"));
        lAData.add(new ListActItem("ทำอะไรดีจ๊ะ","ระยะเวลา : 20 นาที","ประเภท : เกมละลายพฤติกรรม","จำนวนผู้เเล่น : "," > ผู้นำกิจกรรมพูดว่า “ทำอะไรดีจ๊ะ?” ให้ผู้เข้าร่วมที่เป็นผู้ชายถามกลับว่า “ทำอะไรดีครับ ?” ส่วนผู้หญิงถามกลับว่า “ทำอะไรดีค่ะ ?” พร้อมกับปรบมือเป็นจังหวะ\n" +
                "\n" +
                "      > จากนั้นผู้นำกิจกรรมบอกให้ทำอะไร ผู้เข้าร่วมต้องทำตามด้วยความรวดเร็ว เช่น ให้เอามือไปแตะฝาผนังห้อง เอามือไปจับสิ่งของภายในห้องที่เป็นสีเขียว หรือจับกลุ่ม 5 คน เป็นต้น\n" +
                "\n" +
                "      > หากคนไหนทำช้า จะถูกเชิญออกมาด้านหน้าเพื่อสัมภาษณ์ หรือเต้นประกอบเพลงสนุกๆ หลังจากหยุดเล่นเกมแล้ว\n" +
                "\n" +
                "      > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ จนกว่าผู้นำกิจกรรมเห็นสมควร จึงยุติการเล่น\n" +
                "\n" +
                " \n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "\n" +
                "       เล่นได้ทุกช่วง เพื่อกระตุ้นผู้เข้าร่วมให้มีการเคลื่อนไหว ยังสามารถใช้ในการแบ่งกลุ่ม หรือจัดแถว ซึ่งจะทำให้เกิดความรวดเร็ว และสนุกสนานควบคู่กันไปด้วย ","hXQxSi34GWY"));
        lAData.add(new ListActItem("จุดศูนย์กลาง","ระยะเวลา : 5 นาที","ประเภท : เกมละลายพฤติกรรม","จำนวนผู้เเล่น : ","> ให้ผู้เข้าร่วมรวมกลุ่มๆ ละ 3-5 คน แล้วนั่งลงเป็นวงกลมโดยให้หัวเข่าชนกัน (อาจจะเล่นต่อจากเกมทำอะไรดีจ๊ะ ? โดยบอกให้ผู้เข้าร่วมจับกลุ่ม ซึ่งจะทำให้เกิดความรวดเร็ว)\n" +
                "\n" +
                "       > จากนั้นให้แต่ละกลุ่มหาจุดศูนย์กลางของวง แล้วให้ผู้เข้าร่วมเอามือซ้ายไขว้ไปด้านหลัง และมือขวาจับติ่งหูซ้าย\n" +
                "\n" +
                "       > ผู้นำกิจกรรมเล่านิทานให้ฟังเรื่องหนึ่ง และขณะเล่านิทาน ถ้าผู้นำกิจกรรมพูดคำว่า “วัยรุ่น” ให้ผู้เข้าร่วมเอามือที่จับติ่งหูซ้ายตะปบลงไปตรงจุดศูนย์กลางของวง ถ้ามือคนใดอยู่บนสุด แสดงว่าทำช้า ผู้นำกิจกรรมอาจจะเชิญให้ออกมาเต้นประกอบเพลง\n" +
                "\n" +
                "       > โดยคำที่จะใช้พูดควรเกี่ยวข้องกับโครงการ หรือการอบรมนั้นๆ และไม่ควรเกิน 2-3 พยางค์ ซึ่งต้องบอกให้กับผู้เข้าร่วมรับทราบ ก่อนที่จะเริ่มเล่านิทาน\n" +
                "\n" +
                "       > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ สัก 2-3 รอบ โดยเปลี่ยนคำด้วย\n" +
                "\n" +
                " \n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "\n" +
                "       จะขึ้นอยู่กับผู้นำกิจกรรมเป็นสำคัญ หากผู้นำเล่านิทานได้อรรถรส มีลูกเล่น ชั้นเชิง น้ำเสียงน่าตื่นเต้น รู้จังหวะหลอกล่อด้วยคำที่ขึ้นต้นเหมือนกัน เช่น วัยรุ่น ก็อาจจะพูดคำว่า วัยเยาว์ เป็นต้น นอกจากนี้นิทานที่เล่า ถ้าเป็นเรื่องราวที่นำเข้าสู่การอบรมได้ ก็จะเป็นการเพิ่มคุณค่าของเกมนี้ได้อีกด้วย","bqzDuRz_P7g"));
        lAData.add(new ListActItem("ช่องว่างในหัวใจ ","ระยะเวลา : 9 นาที","ประเภท : เกมละลายพฤติกรรม","จำนวนผู้เเล่น : ","> ให้ผู้เข้าร่วมนั่งเป็นวงกลมใหญ่ 1 วง\n" +
                "\n" +
                "      > ให้แต่ละคนบอกชื่อของตัวเองดังๆ เพื่อให้เพื่อนคนอื่นๆ ได้รู้จักชื่อ ซึ่งแต่ละคนต้องจดจำชื่อของเพื่อนๆ ให้ได้มากๆ หากมีป้ายชื่อให้ปิดป้ายชื่อไว้ด้วย\n" +
                "\n" +
                "      > ผู้นำกิจกรรมถามผู้เข้าร่วมคนหนึ่งว่าคุณรักใคร? โดยต้องเอ่ยชื่อด้วย และคนที่ถูกถามต้องตอบว่าฉันรัก …. (ชื่อของเพื่อนเป็นใครก็ได้ที่ไม่ใช่คนข้างๆ)\n" +
                "\n" +
                "      > จากนั้นคนที่นั่งทางซ้ายมือและขวามือของคนที่ถูกถาม และคนที่ถูกบอกว่ารัก ต้องวิ่งสลับที่นั่งกับเพื่อนในขณะเดียวกันผู้นำกิจกรรม ก็จะต้องเข้าไปแย่งที่นั่งด้วย\n" +
                "\n" +
                "      > เมื่อผู้นำกิจกรรมสามารถเข้าไปแย่งที่นั่งได้แล้ว จะทำให้มีผู้เข้าร่วมเหลือหนึ่งคนอยู่ตรงกลางวง แล้วจึงถามต่อว่า ….. รักใคร ? เช่นเดิม ก็จะเกิดการแย่งที่นั่งขึ้นอีกครั้ง\n" +
                "\n" +
                "      > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ จนกว่าผู้นำกิจกรรมเห็นสมควร จึงยุติการเล่น\n" +
                "\n" +
                " \n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "\n" +
                "       จะทำให้ผู้เข้าร่วมรู้จักชื่อของเพื่อนและคุ้นเคยกันได้ดียิ่งขึ้น นอกจากนี้ผู้นำกิจกรรมยังสามารถนำเอาเรื่องการบอกรักมาให้แง่คิดแก่ผู้เข้าร่วมได้อีกด้วย กล่าวคือความรักเป็นสิ่งที่ดีมีคุณค่าเราสามารถบอกรักทุกๆ คนได้ ทั้ง พ่อแม่ พี่น้อง และเพื่อนๆ เป็นต้น","4gX_p1VkgA4"));
        lAData.add(new ListActItem("รถไฟฟ้า มาหานะเธอ ","ระยะเวลา : 9 นาที","ประเภท : เกมเละลายพฤติกรรม","จำนวนผู้เเล่น : ","> ให้ผู้เข้าร่วมนั่งเป็นวงกลมใหญ่ 1 วง โดยเว้นช่องว่างไว้ 1 ช่อง\n" +
                "\n" +
                "       > ผู้นำกิจกรรมชี้แจงว่า ให้ผู้เข้าร่วมสังเกตดูว่าถ้าข้างๆ เรามีช่องว่างเกิดขึ้นให้จับมือกับเพื่อนอีกคนไปหาเพื่อน 1 คน มานั่งเพื่อเติมช่องว่างให้เต็ม เมื่อเกิดช่องว่างตรงไหนก็ให้หาเพื่อนมาเติมข้างตัวเองให้เต็มอย่างรวดเร็ว ซึ่งในขณะเล่นควรจะชวนผู้เข้าร่วมร้องเพลงด้วยกัน หรือเปิดซีดี ก็ได้   \n" +
                "\n" +
                "       > เมื่อผู้นำกิจกรรมเป่านกหวีด ผู้เข้าร่วมคู่ไหนที่ยังหาเพื่อนอีกคนมาเติมลงในช่องว่างไม่ได้ หรือช้า ยังวิ่งกลับไม่ถึงที่ ผู้นำกิจกรรมก็ให้ออกไปอยู่นอกวง\n" +
                "\n" +
                "       > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ จนกว่าผู้นำกิจกรรมเห็นสมควร จึงยุติการเล่น\n" +
                "\n" +
                "       > จากนั้นผู้นำกิจกรรมจึงเชิญให้ผู้ที่อยู่นอกวงกลมใหญ่ออกมาสัมภาษณ์ และเต้นประกอบเพลงสนุกๆ\n" +
                "\n" +
                " \n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "\n" +
                "       ผู้เข้าร่วมจะรู้สึกตื่นเต้นและรีบวิ่งเมื่อข้างๆ ตนเองเกิดช่องว่าง ที่สำคัญต้องวิ่งไปพร้อมกับเพื่อนอีกคน ก็จะทำให้เกิดความคุ้นเคยกันในบรรยากาศของความสนุกกับเสียงเพลง และเงื่อนไขของเวลาก็จะทำให้เกิดความตื่นเต้นมากยิ่งขึ้น ที่สำคัญเพลงที่ใช้ร้องหรือเปิดซีดี ต้องเป็นจังหวะเร็ว","vHS9E6JFja8"));
        lAData.add(new ListActItem("4 ห้องหัวใจ ","ระยะเวลา : 9 นาที","ประเภท : เกมเตรียมความพร้อม","จำนวนผู้เเล่น : ","> ผู้นำกิจกรรมอธิบายว่ารถไฟ 1 ขบวน ประกอบด้วยหลายโบกี้ ให้ผู้เข้าร่วมหนึ่งคนแทนด้วย 1 โบกี้\n" +
                "\n" +
                "    > เมื่อผู้นำกิจกรรมบอกให้ต่อกันเป็น 4 โบกี้ ผู้เข้าร่วมก็ต้องต่อแถวกัน 4 คน โดยผู้นำกิจกรรมต้องกำหนดเพิ่มเติม ว่าหัวขบวนต้องเป็นคนลักษณะใด โดยเปรียบเทียบกับคนในขบวนของตนเอง เช่น คนที่สูงที่สุด ผมยาวที่สุด ต้องเป็นผู้หญิง หรือน่ารักที่สุด เป็นต้น ซึ่งต้องกำหนดเวลาด้วยอาจจะรอบละ 30 วินาที เมื่อหมดเวลาก็เป่าสัญญาณนกหวีด และขบวนใดที่ช้า หรือทำไม่ถูกกติกา ก็อาจจะมีการคัดออกเพื่อหาผู้ชนะต่อไป\n" +
                "\n" +
                "    > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ โดยเปลี่ยนคำสั่ง เป็น 5 โบกี้ หรือ 6 โบกี้ รวมทั้งต้องบอกถึงลักษณะพิเศษของคนที่จะเป็นหัวขบวนด้วยจนกว่าผู้นำกิจกรรมเห็นสมควรจึงยุติการเล่น\n" +
                "\n" +
                " \n" +
                "\n" +
                "    จุดเด่นของเกม \n" +
                "\n" +
                "    อยู่ที่ความวุ่นวายของผู้เข้าร่วมที่จะต้องวิ่งวุ่นต่อแถวเป็นรถไฟกับเพื่อนๆ แถมยังต้องหาคนที่มีคุณลักษณะตามที่ผู้นำกิจกรรมกำหนดให้ เป็นหัวขบวนอีกด้วย และเงื่อนไขของเวลาที่กำหนดก็จะช่วยเพิ่มความสนุกสนานมากยิ่งขึ้น ที่สำคัญผู้นำต้องสามารถควบคุมความวุ่นวายที่เกิดขึ้น โดยการใช้นกหวีด ","JFgv8bKfxEs"));
        lAData.add(new ListActItem("พายุเฮอริเคน","ระยะเวลา : 10-15 นาที","ประเภท : เกมเสริมสร้างทักษะชีวิต","จำนวนผู้เล่น : "," > ให้ผู้เข้าร่วมแบ่งเป็น 2 กลุ่มๆ ละเท่าๆ กัน (ไม่ควรเกิน 15 คน ขึ้นอยู่กับสถานที่ด้วย) จัดแถวเรียงหน้ากระดานจับมือกันไว้ โดยมีระยะห่างพอประมาณ\n" +
                "\n" +
                "       > ให้ผู้เข้าแข่งขันนับหมายเลข จากคนแรกถึงคนสุดท้าย แล้วจำหมายเลขของตนเองไว้\n" +
                "\n" +
                "       > ถ้าผู้นำกิจกรรม พูดหมายเลขขึ้นมา 2 หมายเลข เช่น หมายเลข 5 กับ 6 ให้คนที่นับหมายเลข 5 กับ 6 ชูมือข้างที่จับกันไว้แล้วยกขึ้นสูงๆ\n" +
                "\n" +
                "       > จากนั้นคนที่อยู่หัวแถวและท้ายแถว ต้องวิ่งมาลอดแขนแล้วกลับไปอยู่ที่เดิมอย่างรวดเร็ว โดยห้ามปล่อยมือ ส่วนคนที่นับหมายเลข 5 กับ 6 ก็หมุนตัวกลับด้วย\n" +
                "\n" +
                "       > เมื่อทุกคนกลับสู่ที่เดิมแล้ว ก็ให้นั่งลงพร้อมกับส่งเสียง เฮ้! ดังๆ ถือว่าเป็นฝ่ายชนะ แต่ถ้ามือที่จับกันไว้หลุด ให้ถือว่าอีกกลุ่มเป็นผู้ชนะ แต่ถ้ามือหลุดทั้ง 2 กลุ่ม ก็ให้เล่นใหม่\n" +
                "\n" +
                "       > เล่นในลักษณะเช่นนี้ 3 รอบ ถ้ากลุ่มใดชนะ 2 ใน 3 ถือว่าเป็นฝ่ายชนะ แล้วอาจจะไปแข่งชิงชนะเลิศกับกลุ่มอื่นๆ ต่อไป \n" +
                "\n" +
                " \n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "\n" +
                "       คือ การที่ผู้เข้าร่วมทุกคนจะต้องตื่นตัวอยู่เสมอ เพื่อตั้งใจฟังว่าผู้นำจะพูดถึงหมายเลขอะไร ทำให้เกิดการลุ้น ตื่นเต้น แล้วทุกคนในกลุ่มยังได้เคลื่อนไหวด้วยกันทั้งหมด แต่มีข้อควรระวัง เนื่องจากผู้เล่นจะต้องวิ่ง ดังนั้น ต้องดูบริเวณโดยรอบว่ามีขนาดกว้างเพียงพอ พื้นไม่ลื่น และไม่มีสิ่งกีดขวางใดๆ ที่จะทำให้เกิดอันตรายได้ รวมทั้งถ้าผู้เล่นสวมใส่กระโปรงคงไม่สะดวกในการเล่นเกมนี้","TcdeTC0W16k"));
        lAData.add(new ListActItem("ผู้ชนะสิบทิศ","ระยะเวลา : 30 นาที","ประเภท : เกมเสริมสร้างทักษะชีวิต","จำนวนผู้เล่น : ","> ให้ผู้เข้าร่วมแบ่งเป็น 2-4 กลุ่มๆ ละเท่าๆ กัน ตั้งแถวตอนเรียงลึกแล้วนั่งลง จากนั้นเอาเก้าอี้วางไว้ท้ายแถว กลุ่มละ 1 ตัว\n" +
                "\n" +
                "       > พี่เลี้ยงถือลูกโป่งยืนอยู่หน้าแถว โดยที่ผู้เข้าที่อยู่หัวแถวชูมือเพื่อเตรียมรับลูกโป่งจากพี่เลี้ยง\n" +
                "\n" +
                "       > เมื่อผู้นำกิจกรรมเป่านกหวีด คนหัวแถวรับลูกโป่งจากพี่เลี้ยง แล้วส่งข้ามศีรษะต่อให้กับคนที่อยู่ข้างหลังโดยห้ามหันไปมอง เมื่อลูกโป่งส่งไปถึงคนสุดท้าย ให้คนสุดท้ายขึ้นไป ยืนบนเก้าอี้ แล้วส่งลูกโป่งกลับมายังด้านหน้า เมื่อส่งมาถึงคนแรก ก็ให้คนแรกยืนขึ้นพร้อมกับส่งเสียง เฮ้! ดังๆ ถือว่าเป็นฝ่ายชนะ\n" +
                "\n" +
                "       > ถ้ากลุ่มไหนหันหลังไปมองเพื่อนขณะที่ส่งลูกโป่ง ถือว่ากลุ่มนั้นทำผิดกติกา ปรับแพ้ในรอบนี้ แต่ถ้าลูกโป่งหลุดออกจากแถวก็ให้คนที่ทำหลุดนั้นเก็บคืนมา แล้วจึงส่งต่อได้\n" +
                "\n" +
                "       > เล่นในลักษณะเช่นนี้ 3 รอบ ถ้ากลุ่มใดชนะ 2 ใน 3 ถือว่าเป็นฝ่ายชนะ แล้วอาจจะไปแข่งชิงชนะเลิศกับกลุ่มอื่น ๆ ต่อไป  \n" +
                "\n" +
                " \n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "\n" +
                "       ที่ชัดเจนที่สุด คือ ความตื่นเต้น และสนุกสนาน โดยเฉพาะเมื่อมีทีมแข่งขันมากกว่า 2 ทีม เพราะต้องลุ้นให้ลูกโป่งของกลุ่มตนเองกลับมาถึงคนแรกก่อน แล้วยังต้องลุ้นไม่ให้ลูกโป่งแตกอีกด้วย  ซึ่งผู้นำต้องพูดเชียร์กระตุ้นตลอดการแข่งขันเพื่อเป็นการสร้าง บรรยากาศ ข้อสังเกต ผู้นำและทีมงานต้องช่วยกันดูว่ามีกลุ่มใดทำผิดกติการึเปล่า หากมีก็จะให้แพ้ในรอบนั้นๆ ซึ่งต้องสังเกตดีๆ เพราะการเล่นจะเป็นไปด้วยความรวดเร็ว ไม่ได้ถือเป็นการจับผิด แต่จะปลูกฝังให้ผู้เข้าร่วมรักษากติกาในสังคม และไม่เป็นคนขี้โกงเพื่อให้          \n" +
                "\n" +
                "ได้มาซึ่งชัยชนะ","CvVBQ6n9o_0"));
        lAData.add(new ListActItem("Yes / No / OK","ระยะเวลา : 45 นาที","ประเภท : เกมเสริมสร้างทักษะชีวิต","จำนวนผู้เล่น : ","> นำป้ายบัตรคำ (เป็นคำที่เกี่ยวข้องกับเนื้อหาการอบรม) ไปติดตามเสา หรือฝาผนัง รอบๆ ห้องประชุมโดยให้มีระยะห่างประมาณ 3-4 เมตร\n" +
                "\n" +
                "      > ให้ผู้เข้าร่วมร้องเพลง หรือเปิดซีดี และเต้นไปด้วยกัน เมื่อเพลงหยุดให้รีบไปอยู่ตามจุดที่ติดบัตรคำไว้ซึ่งอาจไปกันเป็นกลุ่ม หรือกระจายกันไปอยู่ก็ได้ (ขึ้นอยู่กับการวางแผนของผู้เข้าร่วมแต่ละกลุ่ม)\n" +
                "\n" +
                "      > ผู้นำกิจกรรมเป่าสัญญาณนกหวีด ซึ่งผู้เข้าร่วมไม่สามารถเปลี่ยนไปอยู่บัตรคำอื่นได้\n" +
                "\n" +
                "      > ผู้นำกิจกรรมจับฉลากขึ้นมา 1 ใบ แล้วอ่าน เช่น คำในฉลากเป็นคำว่า “ดนตรี” กลุ่มที่อยู่ป้ายบัตรคำดนตรีก็ตกรอบ ให้ออกไปอยู่ด้านนอกของการแข่งขัน\n" +
                "\n" +
                "      > เล่นในลักษณะเช่นนี้ไปเรื่อยๆ จนเหลือผู้เข้าแข่งขันน้อยที่สุด จึงจะยุติการแข่งขัน แล้วให้คะแนนแต่ละกลุ่มตามจำนวนคนที่เข้ารอบ\n" +
                "\n" +
                " \n" +
                "\n" +
                "    จุดเด่นของเกมนี้\n" +
                "\n" +
                "      อยู่ที่การดึงเอาคำที่เกี่ยวข้องกับการอบรมมาใช้ในการเล่น เพื่อเชื่อมโยงสู่เนื้อหา หรือสร้างความคุ้นเคยกับคำต่างๆ เช่น อบรมเกี่ยวกับยาเสพติด ก็เขียนบัตรคำเป็นประเภทของยาเสพติด ได้แก่ สุรา บุหรี่ ยาบ้า กัญชา เป็นต้น หรือ อบรมเกี่ยวกับสิ่งแวดล้อม ก็เขียนบัตรคำ ได้แก่ ป่าไม้ ภูเขา ทะเล เป็นต้น นอกจากนี้ยังโดดเด่นในเรื่องการวางแผนที่จะกระจายสมาชิกในกลุ่มให้ไปอยู่ตามจุดต่างๆ ข้อสังเกต หากในแต่ละรอบ มีคนตกรอบน้อย อาจจะเพิ่มการจับฉลากเป็นครั้งละ 2 ใบก็ได้ เพื่อกิจกรรมจะได้กระชับ","hLv5MBuSYDY"));
        lAData.add(new ListActItem("เรียกชื่อ","ระยะเวลา : ??","ประเภท : เกมเสริมสร้างทักษะชีวิต","จำนวนผู้เล่น : "," > ให้ผู้เข้าร่วมนั่งเป็นวงกลมตามกลุ่ม\n" +
                "\n" +
                "      > ผู้นำกิจกรรมเขียนคำตอบลงในกระดาษ A4 จากนั้นพับเก็บไว้ โดยไม่ให้ผู้เข้าร่วมทราบ\n" +
                "\n" +
                "      > ผู้นำกิจกรรมชี้แจงวิธีการเล่น โดยให้ผู้เข้าร่วมตั้งคำถามขึ้นมา ซึ่งผู้นำจะสามารถตอบได้แค่ คำว่า YES หรือ NO เท่านั้น เช่น หากผู้เข้าร่วมถามว่า “เป็นสิ่งของที่กินได้ใช่หรือไม่” ถ้าผู้นำตอบ YES ก็จะได้สิทธิ์ในการถามต่อ แต่ถ้าผู้นำตอบ NO ก็จะเป็นโอกาสของกลุ่มถัดไป\n" +
                "\n" +
                "      > ตั้งคำถามเช่นนี้ไปเรื่อยๆ จนกว่าจะมีกลุ่มไหนมั่นใจจึงขอตอบ ถ้าเป็นคำตอบที่ถูกต้อง ผู้นำก็จะต้องพูดว่า OK เพื่อให้คะแนน หรือรางวัล แต่ถ้าเป็นคำตอบที่ผิด กลุ่มนั้นหมดสิทธิ์ในการแข่งขัน\n" +
                "\n" +
                "      > แต่ถ้าใช้เวลาพอสมควรแล้ว ไม่มีกลุ่มใดที่สามารถตอบได้ ผู้นำกิจกรรมอาจมีคำใบ้ให้ แล้วเล่นต่อไปจนกว่าจะมีกลุ่มที่ตอบได้\n" +
                "\n" +
                "      > เล่นในลักษณะเช่นนี้สัก 2-3 รอบ (ขึ้นอยู่กับเวลาที่มี) และเปลี่ยนป้ายคำตอบในแต่ละครั้ง\n" +
                "\n" +
                " \n" +
                "\n" +
                "     จุดเด่นของเกมนี้\n" +
                "\n" +
                "      คือ การฝึกทักษะการคิด จับประเด็น และการตั้งคำถาม ไม่ต้องใช้อุปกรณ์ หรืออาศัยการเตรียมใดๆ เพียงแต่คำตอบที่ผู้นำเขียนลงบนกระดาษนั้น ควรจะเป็นสิ่งที่เป็นรูปธรรมจับต้องได้ และไม่ยากมากจนเกินไปข้อสังเกต หากกลุ่มใดตั้งคำถามช้าจะทำให้บรรยากาศดูน่าเบื่อ ดังนั้นผู้นำต้องกระตุ้นให้สมาชิกทุกคนในกลุ่มช่วยกัน","Fhk4Qzj_QpM"));

        // adapter ini and setup

        lAAdapter = new ListActAdapter(this,lAData);
        lARecyclerview.setAdapter(lAAdapter);
        lARecyclerview.setLayoutManager(new LinearLayoutManager(this));


        lASearchInput.addTextChangedListener(new TextWatcher() {
            @Override
            public void beforeTextChanged(CharSequence s, int start, int count, int after) {

            }

            @Override
            public void onTextChanged(CharSequence s, int start, int before, int count) {


                lAAdapter.getFilter().filter(s);
                lAsearch = s;


            }

            @Override
            public void afterTextChanged(Editable s) {

            }
        });

        btBack = findViewById(R.id.actback);
        btBack.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                finish();
            }
        });


    }


}
